Revit 2024 API
EvaluatedParameter Methods
The EvaluatedParameter type exposes the following members.
Methods
Name | Description
AsValueString(Document)
 Get the parameter value as a string with units.
AsValueString(Document, FormatOptions)
 Get the parameter value as a string with units.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
EvaluatedParameter Class
Autodesk.Revit.DB Namespace